Coding/Cpp/linux_time.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Linux下时间函数</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="Linux下时间函数"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-19 19:34:08 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="H" href="../../index.html#cpp"> HOME </a>
</div>


<div id="content">
<h1 class="title">Linux下时间函数</h1>

<p>CANNOT INCLUDE FILE ../template2.org<br/>
</p>
<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 时间类型。</a></li>
<li><a href="#sec-2">2 时间操作</a></li>
<li><a href="#sec-3">3 延时函数</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 时间类型。</h2>
<div class="outline-text-2" id="text-1">

<p>  Linux下常用的时间类型有4个：time_t，struct timeval，struct timespec，struct tm。<br/>
</p><ul>
<li>time_t是一个长整型，一般用来表示用1970年以来的秒数。<br/>
</li>
<li>truct timeval有两个成员，一个是秒，一个是微妙。<br/>
</li>
</ul>


<p><br/>
<pre class="src src-java"><span style="color: #228b22;">struct</span> <span style="color: #a0522d;">timeval</span>
{
    <span style="color: #228b22;">long</span> <span style="color: #a0522d;">tv_sec</span>;
    <span style="color: #228b22;">long</span> <span style="color: #a0522d;">tv_usec</span>;
};
</pre>

</p><ul>
<li>struct timespec有两个成员，一个是秒，一个是纳秒。<br/>
</li>
</ul>


<p><br/>
<pre class="src src-java"><span style="color: #228b22;">struct</span> <span style="color: #a0522d;">timespec</span>
{
    <span style="color: #228b22;">time_t</span> <span style="color: #a0522d;">tv_sec</span>;
    <span style="color: #228b22;">long</span> <span style="color: #a0522d;">tv_nsec</span>;
};
</pre>

</p><ul>
<li>truct tm是直观意义上的时间表示方法：<br/>
</li>
</ul>


<p><br/>
<pre class="src src-java"><span style="color: #228b22;">struct</span> <span style="color: #a0522d;">tm</span>
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tm_sec</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tm_min</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tm_hour</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tm_mday</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tm_mon</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tm_year</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tm_wday</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tm_yday</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tm_isdst</span>;
};
</pre>

</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 时间操作</h2>
<div class="outline-text-2" id="text-2">

<p>（1） 时间格式间的转换函数<br/>
主要是 time_t、struct tm、时间的字符串格式之间的转换。看下面的函数参数类型以及返回值类型：<br/>
</p>
<p><br/>
<pre class="src src-java"><span style="color: #228b22;">char</span> *asctime(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">struct</span> <span style="color: #a0522d;">tm</span> *tm);
<span style="color: #228b22;">char</span> *ctime(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">time_t</span> *timep);
<span style="color: #228b22;">struct</span> <span style="color: #0000ff;">tm</span> *gmtime(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">time_t</span> *timep);
<span style="color: #228b22;">struct</span> <span style="color: #0000ff;">tm</span> *localtime(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">time_t</span> *timep);
<span style="color: #228b22;">time_t</span> <span style="color: #0000ff;">mktime</span>(<span style="color: #228b22;">struct</span> <span style="color: #a0522d;">tm</span> *tm);
</pre>

gmtime和localtime的参数以及返回值类型相同，区别是前者返回的格林威治标准时间，后者是当地时间。<br/>
（2） 获取时间函数<br/>
两个函数，获取的时间类型看原型就知道了：<br/>
</p>
<p><br/>
<pre class="src src-java"><span style="color: #228b22;">time_t</span> <span style="color: #0000ff;">time</span>(time_t *t);
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">gettimeofday</span>(<span style="color: #228b22;">struct</span> <span style="color: #a0522d;">timeval</span> *tv, <span style="color: #228b22;">struct</span> <span style="color: #a0522d;">timezone</span> *tz);
</pre>

前者获取time_t类型，后者获取struct timeval类型，因为类型的缘故，前者只能精确到秒，后者可以精确到微秒。<br/>
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 延时函数</h2>
<div class="outline-text-2" id="text-3">

<p>主要的延迟函数有：sleep(),usleep(),nanosleep(),select(),pselect().<br/>
</p>
<p><br/>
<pre class="src src-java">unsigned <span style="color: #228b22;">int</span> <span style="color: #0000ff;">sleep</span>(unsigned <span style="color: #228b22;">int</span> <span style="color: #a0522d;">seconds</span>);
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">usleep</span>(unsigned <span style="color: #228b22;">long</span> <span style="color: #a0522d;">usec</span>);
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">nanosleep</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">struct</span> <span style="color: #a0522d;">timespec</span> *req, <span style="color: #228b22;">struct</span> <span style="color: #a0522d;">timespec</span> *rem);
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">select</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">n</span>, fd_set *readfds, fd_set *writefds, fd_set *exceptfds,<span style="color: #228b22;">struct</span> <span style="color: #a0522d;">timeval</span> *timeout);
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">pselect</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">n</span>, fd_set *readfds, fd_set *writefds, fd_set *exceptfds, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">struct</span> <span style="color: #a0522d;">timespec</span> *timeout, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">sigset_t</span> *sigmask);
</pre>

alarm函数是信号方式的延迟，这种方式不直观，这里不说了。<br/>
仅通过函数原型中时间参数类型，可以猜测sleep可以精确到秒级，usleep/select可以精确到微妙级，nanosleep和pselect可以精确到纳秒级。<br/>
而实际实现中，linux上的nanosleep和alarm相同，都是基于内核时钟机制实现，受linux内核时钟实现的影响，并不能达到纳秒级的精度，man nanosleep也可以看到这个说明，man里给出的精度是：Linux/i386上是10 ms ，Linux/Alpha上是1ms。<br/>
这里有一篇文章<a href="http://blog.csdn.net/zhoujunyi/archive/2007/03/30/1546330.aspx">http://blog.csdn.net/zhoujunyi/archive/2007/03/30/1546330.aspx</a>，<br/>
测试了不同延迟函数之间的精确度。文章给出的结论是linux上精度最高的是select，10ms级别。我在本机器测试select和pselect相当，都达到了1ms级的精度，精度高于文章中给出的10ms，sleep在秒级以上和usleep/nanosleep相当。下面贴下我机器上1ms时候的测试结果，其他不贴了：<br/>
</p>
<p><br/>
sleep 1000 0 -1000<br/>
usleep 1000 2974 1974<br/>
nanosleep 1000 2990 1990<br/>
select 1000 991 -9<br/>
pselect 1000 990 -10<br/>
gettimeofday 1000 1000 0<br/>
而使用gettimeofday循环不停检测时间，可精确微秒级，不过不适宜用来做定时器模块。<br/>
因此后面的定时器模块将选择select为延迟函数。<br/>
<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</p></div>
</div>
</div>

</body>
</html>
